import React, {Component} from 'react'
import TimeDay from './TimeDay'

const week = [
    'Понедельник',
    'Вторник',
    'Среда',
    'Четверг',
    'Пятница',
    'Суббота'
]

const days = {
    'Понедельник': [
        {
            time: '8:30 - 10:05',
            data: {
                'ПИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['Дискретная математика', '-']
                },
                'БИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                },
                'ПМИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                },
                'ФИиИТ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                } 
            }
        },
        {
            time: '10:20 - 11:55',
            data: {
                'ПИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['Дискретная математика', '-']
                },
                'БИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                },
                'ПМИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                },
                'ФИиИТ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                } 
            }
        },
        {
            time: '12:10 - 13:45',
            data: {
                'ПИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['Дискретная математика', '-']
                },
                'БИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                },
                'ПМИ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                },
                'ФИиИТ': {
                    '-': ['Дискретная математика', 'Дискретная математика'],
                    '+': ['-', '-']
                } 
            }
        }
    ],
    'Вторник': [],
    'Среда': [],
    'Четверг': [],
    'Пятница': [],
    'Суббота': []
}

const directions = [
    {
        abbr: 'ПИ',
        number: 1
    },
    {
        abbr: 'БИ',
        number: 2
    },
    {
        abbr: 'ПМИ',
        number: 4
    },
    {
        abbr: 'ФИиИТ',
        number: 6
    }
]

class TimeTable extends Component {
    render() {
        return (
            <div>
                {week.map((day, key) => (
                    <TimeDay 
                        day={day} 
                        key={key} 
                        faculty={this.props.match.params.faculty} 
                        cource={this.props.match.params.cource} 
                        data={days[day]}
                        directions={directions}
                    />
                ))}
            </div>
        )
    }
}

export default TimeTable
